{
  "items": [
    {
      "title": "Apeiros",
      "description": "Apeiros is a digital whiteboard app I worked on to help teams and clients brainstorm ideas together online. It's designed to be user-friendly, letting everyone throw ideas around and sketch out concepts. Working on this project, I focused on creating the structure and making the canvas feel smooth and keeping the app running fast, no matter how many ideas were flying around. It was a great experience figuring out how to build something that could bring people's creative processes together, even when they're miles apart.<br /><br />The most challenging part of developing Apeiros was definitely getting the geometry right. Working with shapes and making sure everything aligned perfectly on the canvas required a lot of precision and testing. But in the end, I got better at geometry too.",
      "tags": ["react js", "node js"],
      "images": [
        {
          "url": "apeiros.jpg",
          "alt": "Apeiros",
          "slug": "apeiros"
        }
      ]
    },
    {
      "title": "Person Alarm",
      "description": "For a class project at university, I built something called Person Alarm. It’s basically a camera that keeps an eye on risky areas. Using an ESP32-CAM and Python (open cv, yolo v3, django), it watches for anyone approaching where they shouldn’t be. When it detects movement, it snaps a photo and checks if there’s a person in it. If there is, it quickly sends an alert to my phone. It was a fun challenge mixing electronics with code.",
      "tags": ["embedded systems", "django", "c++"],
      "images": [
        {
          "url": "person-alarm.jpeg",
          "alt": "Person Alarm",
          "slug": "person-alarm"
        },
        {
          "url": "person-alarm2.jpg",
          "alt": "Person Alarm",
          "slug": "person-alarm2"
        }
      ]
    },
    {
      "title": "Umitde.com",
      "description": "I built my personal website using SvelteKit, mainly to keep all my blog posts in one spot and show my works. It’s a simple, clean site where I can share my thoughts. It was fun learning more about SvelteKit.<br /><br />I also designed it by myself because of the several reasons. Feel free to use. It's open source!",
      "tags": ["SvelteKit"],
      "images": [
        {
          "url": "umitde.jpg",
          "alt": "Umitde.com",
          "slug": "umitde"
        }
      ]
    },
    {
      "title": "Hierapi",
      "description": "Hierapi was a multi language e-commerce website I developed from scratch for a company that is based in Turkey. It was my first freelance job and it took almost 6 months to complete. I coded it with Django and Vue js.",
      "tags": ["e-commerce", "vue js", "django"],
      "images": [
        {
          "url": "hierapi.jpg",
          "alt": "Hierapi, an e-commerce app",
          "slug": "hierapi"
        }
      ]
    },
    {
      "title": "Petra Coffee",
      "description": "I designed a website for Petra Coffee (based in Turkey) using shopify.",
      "tags": ["Shopify"],
      "images": [
        {
          "url": "petra.jpg",
          "alt": "Petra coffee roasting",
          "slug": "petra"
        }
      ]
    },
    {
      "title": "Mimic Robot",
      "description": "In high school, I helped creating a project called Mimic Robot for a TÜBİTAK competition. It's a robot made from wood, using an Arduino and a Windows Kinect camera to copy human gestures.",
      "tags": ["embedded systems"],
      "images": [
        {
          "url": "mimic-robot.jpg",
          "alt": "Mimic Robot",
          "slug": "mimic-robot"
        }
      ]
    },
    {
      "title": "Smile Mirror",
      "description": "For a high school project at a TÜBİTAK competition, I worked on a project called Smile Mirror. It’s a mirror that takes a selfie when you smile. I built it with c++ and open cv to recognize smiles and automatically capture photos",
      "tags": ["embedded systems"],
      "images": [
        {
          "url": "smile-mirror.jpg",
          "alt": "Smile mirror",
          "slug": "smile-mirror"
        }
      ]
    },
    {
      "title": "Spor Istanbul CLI",
      "description": "The GYM I go to requires booking spots three days ahead. Manually checking availability makes me sick, and forgetting to do so often leads to missed workouts. So I've built a CLI app with Golang to automate this process. It checks the empty spot periodically and whenever it finds an empty spot, plays an alarm to warn me.",
      "tags": ["go", "cli"],
      "images": [
        {
          "url": "spor-istanbul-cli-1.png",
          "alt": "Spor Istanbul CLI auth screen",
          "slug": "spor-istanbul-cli-1"
        },
        {
          "url": "spor-istanbul-cli-2.png",
          "alt": "Spor Istanbul CLI subscription chooser screen",
          "slug": "spor-istanbul-cli-2"
        },
        {
          "url": "spor-istanbul-cli-3.png",
          "alt": "Spor Istanbul CLI session chooser screen",
          "slug": "spor-istanbul-cli-3"
        },
        {
          "url": "spor-istanbul-cli-4.jpg",
          "alt": "Spor Istanbul CLI wait screen",
          "slug": "spor-istanbul-cli-4"
        }
      ]
    }
  ]
}